# Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#
# *Пример:*
#
# 5
#     1 2 3 4 5
#     3
#     -> 1

from random import randint as RD
n = int(input("Введите количество элементов массива : "))
a = [RD(0,10) for _ in range(n)]
print("Массив состоит из: ", *a)
x = int(input("Введите искомое число : "))
count = 0
for i in a:
    if i == x: count +=1
print(f"Число {x} встречается {count} раз(-а).")
